In [3]:
import pandas as pd

In [4]:
import pandas as pd

In [5]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [6]:
data = {'Country': ['Belgium', 'India', 'Brazil'],

'Capital': ['Brussels', 'New Delhi', 'Brasília'],

'Population': [11190846, 1303171035, 207847528]}

In [7]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])

In [8]:
s['b']

-5

In [9]:
df[:]

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [10]:
df.iloc[[0],[0]]

   Country
0  Belgium

In [11]:
df.iat[0,1]

'Brussels'

In [12]:
df.loc[[0], ['Country']]

   Country
0  Belgium

In [13]:
df.loc[:,'Capital']

0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object

In [14]:
df.at[0, 'Country']

'Belgium'

In [15]:
s[~(s > 1)] 
s[(s < -1) | (s > 2)] 
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [16]:
s['a'] = 6
s.drop(['a', 'c']) 
df.drop('Country', axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [17]:
df.sort_index(ascending=True)
df.sort_values(by='Country', ascending=True)

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [37]:
df = pd.read_csv("data.csv")
# df.head(1000)
# df.info()
# df.shape

In [25]:
df['City'].values

array(['Chamonix', 'Chamonix', 'Chamonix', ..., 'Turin', 'Turin', 'Turin'],
      dtype=object)

In [27]:
df.median() # Median of values

/tmp/ipykernel_28847/3860064408.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median() # Median of values

Year    1988.0
dtype: float64

In [28]:
df.isnull()

       Year   City  Sport  Discipline    NOC  Event  Event gender  Medal
0     False  False  False       False  False  False         False  False
1     False  False  False       False  False  False         False  False
2     False  False  False       False  False  False         False  False
3     False  False  False       False  False  False         False  False
4     False  False  False       False  False  False         False  False
...     ...    ...    ...         ...    ...    ...           ...    ...
2306  False  False  False       False  False  False         False  False
2307  False  False  False       False  False  False         False  False
2308  False  False  False       False  False  False         False  False
2309  False  False  False       False  False  False         False  False
2310  False  False  False       False  False  False         False  False

[2311 rows x 8 columns]

In [32]:
df.isna().any()

Year            False
City            False
Sport            True
Discipline      False
NOC             False
Event           False
Event gender    False
Medal           False
dtype: bool

In [33]:
df.isna().sum()

Year            0
City            0
Sport           1
Discipline      0
NOC             0
Event           0
Event gender    0
Medal           0
dtype: int64

In [34]:
df.dropna(inplace=True)

In [47]:
df = read_csv('data.csv', na_values='?')
df.isna().sum()

Year            0
City            5
Sport           1
Discipline      0
NOC             2
Event           0
Event gender    0
Medal           0
dtype: int64

In [51]:
from pandas import read_csv

df = read_csv('data.csv', header=None, na_values='?')
# df = read_csv('data.csv')


for i in range(df.shape[1]):
    n_miss = df[[i]].isnull().sum()
    perc = n_miss / df.shape[0] * 100
    print('> %d, Missing: %d (%.1f%%)' % (i, n_miss, perc))

> 0, Missing: 0 (0.0%)
> 1, Missing: 5 (0.2%)
> 2, Missing: 1 (0.0%)
> 3, Missing: 0 (0.0%)
> 4, Missing: 2 (0.1%)
> 5, Missing: 0 (0.0%)
> 6, Missing: 0 (0.0%)
> 7, Missing: 0 (0.0%)

In [56]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

df = pd.read_csv('data.csv', header=None, na_values='?')

data =  df.values

ix = [i for i in range(data.shape[1]) if i != 7]

X, y = data[:, ix], data[:, 7]

print('Missing: %d' % sum(np.isnan(X).flatten()))

imputer = SimpleImputer(strategy= 'mean')

imputer.fit(x)

Xtrans = imputer.trasnform(x)

print('Missing: %d' % sum(isnan(Xtrans).flatten()))

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''